import random
import time
import os

os.system("clear")
def eng():
    print("####################################################")
    print("#            🐀 POTKAN LIFE SIMULATOR 🐀          #")
    print("#                                                  #")
    print("#                                                  #")
    print("#              🐀 PRESS [A] TO PLAY 🐀            #")
    print("#              🐀 PRESS [X] TO EXIT 🐀            #")
    print("#        🐀 PRESS [L] TO CHANGE LANGUAGE🐀        #")
    print("#                                                  #")
    print("#                                                  #")
    print("####################################################")

def rus():
    print("####################################################")
    print("#          🐀 СИМУЛЯТОР КРЫСИНОЙ ЖИЗНИ 🐀         #")
    print("#                                                  #")
    print("#                                                  #")
    print("#       🐀 НАЖМИ [A], ЧТОБЫ НАЧАТЬ ИГРУ 🐀        #")
    print("#          🐀 НАЖМИ [X], ЧТОБЫ ВЫЙТИ 🐀           #")
    print("#       🐀 НАЖМИ [L], ЧТОБЫ ИЗМЕНИТЬ ЯЗЫК 🐀      #")
    print("#                                                  #")
    print("#                                                  #")
    print("####################################################")
    
def hun():
    print("####################################################")
    print("#          🐀 PÁTKÁNY ÉLET SZIMULÁTOR  🐀         #")
    print("#                                                  #")
    print("#                                                  #")
    print("# 🐀 NYOMJA MEG AZ [A], A JÁTÉK ELINDíTÁSÁHOZ 🐀  #")
    print("#   🐀 NYOMJA MEG AZ [X] GOMBOT A KILÉPÉSHEZ 🐀   #")
    print("#         🐀 NYOMJA MEG AZ [L] GOMBOT 🐀          #")
    print("#        🐀 A NYELV MEGVÁLTOZTATÁSÁHOZ 🐀         #")
    print("#                                                  #")
    print("####################################################")

def ar():
    print("####################################################")
    print("#           🐀 محاكاة حياة الفئران  🐀          #")
    print("#                                                  #")
    print("#                                                  #")
    print("#            🐀 اضغط [A] لبدء اللعبة🐀           #")
    print("#               🐀 اضغط [X] للخروج 🐀            #")
    print("#           🐀 Nاضغط [L] لتغيير اللغة 🐀         #")
    print("#                                                  #")
    print("####################################################")
    
